MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4KMFYDFG/mcu.h
#define TSB_CAN_AA_AA23                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,23)))
#define TSB_CAN_AA_AA24                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,24)))
#define TSB_CAN_AA_AA25                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,25)))
#define TSB_CAN_AA_AA26                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,26)))
#define TSB_CAN_AA_AA27                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,27)))
#define TSB_CAN_AA_AA28                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,28)))
#define TSB_CAN_AA_AA29                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,29)))
#define TSB_CAN_AA_AA30                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->AA,30)))
#define TSB_CAN_RMP_RMP0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,0)))
#define TSB_CAN_RMP_RMP1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,1)))
#define TSB_CAN_RMP_RMP2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,2)))
#define TSB_CAN_RMP_RMP3                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,3)))
#define TSB_CAN_RMP_RMP4                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,4)))
#define TSB_CAN_RMP_RMP5                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,5)))
#define TSB_CAN_RMP_RMP6                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,6)))
#define TSB_CAN_RMP_RMP7                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,7)))
#define TSB_CAN_RMP_RMP8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,8)))
#define TSB_CAN_RMP_RMP9                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,9)))
#define TSB_CAN_RMP_RMP10                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,10)))
#define TSB_CAN_RMP_RMP11                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,11)))
#define TSB_CAN_RMP_RMP12                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,12)))
#define TSB_CAN_RMP_RMP13                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,13)))
#define TSB_CAN_RMP_RMP14                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,14)))
#define TSB_CAN_RMP_RMP15                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,15)))
#define TSB_CAN_RMP_RMP16                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,16)))
#define TSB_CAN_RMP_RMP17                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,17)))
#define TSB_CAN_RMP_RMP18                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,18)))
#define TSB_CAN_RMP_RMP19                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,19)))
#define TSB_CAN_RMP_RMP20                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,20)))
#define TSB_CAN_RMP_RMP21                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,21)))
#define TSB_CAN_RMP_RMP22                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,22)))
#define TSB_CAN_RMP_RMP23                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,23)))
#define TSB_CAN_RMP_RMP24                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,24)))
#define TSB_CAN_RMP_RMP25                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,25)))
#define TSB_CAN_RMP_RMP26                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,26)))
#define TSB_CAN_RMP_RMP27                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,27)))
#define TSB_CAN_RMP_RMP28                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,28)))
#define TSB_CAN_RMP_RMP29                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,29)))
#define TSB_CAN_RMP_RMP30                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,30)))
#define TSB_CAN_RMP_RMP31                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RMP,31)))
#define TSB_CAN_RML_RML0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,0)))
#define TSB_CAN_RML_RML1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,1)))
#define TSB_CAN_RML_RML2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,2)))
#define TSB_CAN_RML_RML3                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,3)))
#define TSB_CAN_RML_RML4                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,4)))
#define TSB_CAN_RML_RML5                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,5)))
#define TSB_CAN_RML_RML6                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,6)))
#define TSB_CAN_RML_RML7                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,7)))
#define TSB_CAN_RML_RML8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,8)))
#define TSB_CAN_RML_RML9                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,9)))
#define TSB_CAN_RML_RML10                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,10)))
#define TSB_CAN_RML_RML11                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,11)))
#define TSB_CAN_RML_RML12                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,12)))
#define TSB_CAN_RML_RML13                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,13)))
#define TSB_CAN_RML_RML14                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,14)))
#define TSB_CAN_RML_RML15                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,15)))
#define TSB_CAN_RML_RML16                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,16)))
#define TSB_CAN_RML_RML17                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,17)))
#define TSB_CAN_RML_RML18                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,18)))
#define TSB_CAN_RML_RML19                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,19)))
#define TSB_CAN_RML_RML20                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,20)))
#define TSB_CAN_RML_RML21                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,21)))
#define TSB_CAN_RML_RML22                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,22)))
#define TSB_CAN_RML_RML23                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,23)))
#define TSB_CAN_RML_RML24                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,24)))
#define TSB_CAN_RML_RML25                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,25)))
#define TSB_CAN_RML_RML26                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,26)))
#define TSB_CAN_RML_RML27                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,27)))
#define TSB_CAN_RML_RML28                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,28)))
#define TSB_CAN_RML_RML29                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,29)))
#define TSB_CAN_RML_RML30                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,30)))
#define TSB_CAN_RML_RML31                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->RML,31)))
#define TSB_CAN_LAM_LAMI                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->LAM,31)))
#define TSB_CAN_GAM_GAMI                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GAM,31)))
#define TSB_CAN_MCR_SRES                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,0)))
#define TSB_CAN_MCR_TSCC                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,1)))
#define TSB_CAN_MCR_MTOS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,3)))
#define TSB_CAN_MCR_WUBA                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,4)))
#define TSB_CAN_MCR_SMR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,6)))
#define TSB_CAN_MCR_CCR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,7)))
#define TSB_CAN_MCR_TSTERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,8)))
#define TSB_CAN_MCR_TSTLB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,9)))
#define TSB_CAN_MCR_SUR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MCR,11)))
#define TSB_CAN_GSR_EW                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,0)))
#define TSB_CAN_GSR_EP                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,1)))
#define TSB_CAN_GSR_BO                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,2)))
#define TSB_CAN_GSR_TSO                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,3)))
#define TSB_CAN_GSR_SMA                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,6)))
#define TSB_CAN_GSR_CCE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,7)))
#define TSB_CAN_GSR_SUA                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,8)))
#define TSB_CAN_GSR_TM                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,10)))
#define TSB_CAN_GSR_RM                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_CAN->GSR,11)))
#define TSB_CAN_BCR2_SAM                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->BCR2,7)))
#define TSB_CAN_GIF_WLIF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,0)))
#define TSB_CAN_GIF_EPIF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,1)))
#define TSB_CAN_GIF_BOIF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,2)))
#define TSB_CAN_GIF_TSOIF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,3)))
#define TSB_CAN_GIF_TRMABF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,4)))
#define TSB_CAN_GIF_RMLIF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,5)))
#define TSB_CAN_GIF_WUIF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,6)))
#define TSB_CAN_GIF_RFPF                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIF,7)))
#define TSB_CAN_GIM_WLIM                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,0)))
#define TSB_CAN_GIM_EPIM                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,1)))
#define TSB_CAN_GIM_BOIM                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,2)))
#define TSB_CAN_GIM_TSOIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,3)))
#define TSB_CAN_GIM_TRMABF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,4)))
#define TSB_CAN_GIM_RMLIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,5)))
#define TSB_CAN_GIM_WUIM                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,6)))
#define TSB_CAN_GIM_RFPM                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->GIM,7)))
#define TSB_CAN_MBTIF_MBTIF0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,0)))
#define TSB_CAN_MBTIF_MBTIF1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,1)))
#define TSB_CAN_MBTIF_MBTIF2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,2)))
#define TSB_CAN_MBTIF_MBTIF3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,3)))
#define TSB_CAN_MBTIF_MBTIF4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,4)))
#define TSB_CAN_MBTIF_MBTIF5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,5)))
#define TSB_CAN_MBTIF_MBTIF6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,6)))
#define TSB_CAN_MBTIF_MBTIF7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,7)))
#define TSB_CAN_MBTIF_MBTIF8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,8)))
#define TSB_CAN_MBTIF_MBTIF9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,9)))
#define TSB_CAN_MBTIF_MBTIF10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,10)))
#define TSB_CAN_MBTIF_MBTIF11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,11)))
#define TSB_CAN_MBTIF_MBTIF12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,12)))
#define TSB_CAN_MBTIF_MBTIF13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,13)))
#define TSB_CAN_MBTIF_MBTIF14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,14)))
#define TSB_CAN_MBTIF_MBTIF15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,15)))
#define TSB_CAN_MBTIF_MBTIF16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,16)))
#define TSB_CAN_MBTIF_MBTIF17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,17)))
#define TSB_CAN_MBTIF_MBTIF18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,18)))
#define TSB_CAN_MBTIF_MBTIF19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,19)))
#define TSB_CAN_MBTIF_MBTIF20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,20)))
#define TSB_CAN_MBTIF_MBTIF21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,21)))
#define TSB_CAN_MBTIF_MBTIF22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,22)))
#define TSB_CAN_MBTIF_MBTIF23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,23)))
#define TSB_CAN_MBTIF_MBTIF24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,24)))
#define TSB_CAN_MBTIF_MBTIF25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,25)))
#define TSB_CAN_MBTIF_MBTIF26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,26)))
#define TSB_CAN_MBTIF_MBTIF27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,27)))
#define TSB_CAN_MBTIF_MBTIF28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,28)))
#define TSB_CAN_MBTIF_MBTIF29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,29)))
#define TSB_CAN_MBTIF_MBTIF30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBTIF,30)))
#define TSB_CAN_MBRIF_MBRIF0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,0)))
#define TSB_CAN_MBRIF_MBRIF1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,1)))
#define TSB_CAN_MBRIF_MBRIF2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,2)))
#define TSB_CAN_MBRIF_MBRIF3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,3)))
#define TSB_CAN_MBRIF_MBRIF4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,4)))
#define TSB_CAN_MBRIF_MBRIF5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,5)))
#define TSB_CAN_MBRIF_MBRIF6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,6)))
#define TSB_CAN_MBRIF_MBRIF7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,7)))
#define TSB_CAN_MBRIF_MBRIF8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,8)))
#define TSB_CAN_MBRIF_MBRIF9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,9)))
#define TSB_CAN_MBRIF_MBRIF10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,10)))
#define TSB_CAN_MBRIF_MBRIF11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,11)))
#define TSB_CAN_MBRIF_MBRIF12                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,12)))
#define TSB_CAN_MBRIF_MBRIF13                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,13)))
#define TSB_CAN_MBRIF_MBRIF14                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,14)))
#define TSB_CAN_MBRIF_MBRIF15                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,15)))
#define TSB_CAN_MBRIF_MBRIF16                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,16)))
#define TSB_CAN_MBRIF_MBRIF17                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,17)))
#define TSB_CAN_MBRIF_MBRIF18                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,18)))
#define TSB_CAN_MBRIF_MBRIF19                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,19)))
#define TSB_CAN_MBRIF_MBRIF20                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,20)))
#define TSB_CAN_MBRIF_MBRIF21                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,21)))
#define TSB_CAN_MBRIF_MBRIF22                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,22)))
#define TSB_CAN_MBRIF_MBRIF23                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,23)))
#define TSB_CAN_MBRIF_MBRIF24                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,24)))
#define TSB_CAN_MBRIF_MBRIF25                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,25)))
#define TSB_CAN_MBRIF_MBRIF26                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,26)))
#define TSB_CAN_MBRIF_MBRIF27                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,27)))
#define TSB_CAN_MBRIF_MBRIF28                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,28)))
#define TSB_CAN_MBRIF_MBRIF29                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,29)))
#define TSB_CAN_MBRIF_MBRIF30                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,30)))
#define TSB_CAN_MBRIF_MBRIF31                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBRIF,31)))
#define TSB_CAN_MBIM_MBIM0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,0)))
#define TSB_CAN_MBIM_MBIM1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,1)))
#define TSB_CAN_MBIM_MBIM2                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,2)))
#define TSB_CAN_MBIM_MBIM3                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,3)))
#define TSB_CAN_MBIM_MBIM4                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,4)))
#define TSB_CAN_MBIM_MBIM5                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,5)))
#define TSB_CAN_MBIM_MBIM6                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,6)))
#define TSB_CAN_MBIM_MBIM7                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,7)))
#define TSB_CAN_MBIM_MBIM8                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,8)))
#define TSB_CAN_MBIM_MBIM9                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,9)))
#define TSB_CAN_MBIM_MBIM10                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,10)))
#define TSB_CAN_MBIM_MBIM11                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,11)))
#define TSB_CAN_MBIM_MBIM12                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,12)))
#define TSB_CAN_MBIM_MBIM13                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,13)))
#define TSB_CAN_MBIM_MBIM14                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,14)))
#define TSB_CAN_MBIM_MBIM15                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,15)))
#define TSB_CAN_MBIM_MBIM16                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,16)))
#define TSB_CAN_MBIM_MBIM17                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,17)))
#define TSB_CAN_MBIM_MBIM18                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,18)))
#define TSB_CAN_MBIM_MBIM19                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,19)))
#define TSB_CAN_MBIM_MBIM20                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,20)))
#define TSB_CAN_MBIM_MBIM21                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,21)))
#define TSB_CAN_MBIM_MBIM22                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,22)))
#define TSB_CAN_MBIM_MBIM23                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,23)))
#define TSB_CAN_MBIM_MBIM24                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,24)))
#define TSB_CAN_MBIM_MBIM25                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,25)))
#define TSB_CAN_MBIM_MBIM26                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,26)))
#define TSB_CAN_MBIM_MBIM27                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,27)))
#define TSB_CAN_MBIM_MBIM28                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,28)))
#define TSB_CAN_MBIM_MBIM29                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,29)))
#define TSB_CAN_MBIM_MBIM30                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,30)))
#define TSB_CAN_MBIM_MBIM31                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->MBIM,31)))
#define TSB_CAN_CDR_CDR0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,0)))
#define TSB_CAN_CDR_CDR1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,1)))
#define TSB_CAN_CDR_CDR2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,2)))
#define TSB_CAN_CDR_CDR3                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,3)))
#define TSB_CAN_CDR_CDR4                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,4)))
#define TSB_CAN_CDR_CDR5                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,5)))
#define TSB_CAN_CDR_CDR6                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,6)))
#define TSB_CAN_CDR_CDR7                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,7)))
#define TSB_CAN_CDR_CDR8                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,8)))
#define TSB_CAN_CDR_CDR9                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,9)))
#define TSB_CAN_CDR_CDR10                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,10)))
#define TSB_CAN_CDR_CDR11                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,11)))
#define TSB_CAN_CDR_CDR12                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,12)))
#define TSB_CAN_CDR_CDR13                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,13)))
#define TSB_CAN_CDR_CDR14                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,14)))
#define TSB_CAN_CDR_CDR15                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,15)))
#define TSB_CAN_CDR_CDR16                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,16)))
#define TSB_CAN_CDR_CDR17                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,17)))
#define TSB_CAN_CDR_CDR18                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,18)))
#define TSB_CAN_CDR_CDR19                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,19)))
#define TSB_CAN_CDR_CDR20                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,20)))
#define TSB_CAN_CDR_CDR21                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,21)))
#define TSB_CAN_CDR_CDR22                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,22)))
#define TSB_CAN_CDR_CDR23                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,23)))
#define TSB_CAN_CDR_CDR24                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,24)))
#define TSB_CAN_CDR_CDR25                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,25)))
#define TSB_CAN_CDR_CDR26                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,26)))
#define TSB_CAN_CDR_CDR27                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CAN->CDR,27)))
